InformationRegisters/НазначенныеСубсидии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеСубсидии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеЛьготы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеЛьготы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧленовСемьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоциальнаяНормаНаЛьготника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоциальнаяНормаНаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПотребительУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ПроверкаПересеченияЛьготИСубсидий/Ext/Form/Module.bsl
&НаКлиенте
Процедура СсылкаНаЗаконНажатие(Элемент)
	ЗапуститьПриложение("http://zakon2.rada.gov.ua/laws/show/319-2016-%D0%BF");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Константы.НеПроверятьПересечениеЛьготИСубсидийПриЗапуске.Получить() тогда
		Отказ = Истина;
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ Субсидии
		|ИЗ
		|	РегистрСведений.НазначенныеСубсидии.СрезПоследних(&ТекПериод, ) КАК НазначенныеСубсидииСрезПоследних
		|ГДЕ
		|	НазначенныеСубсидииСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
		|ПОМЕСТИТЬ Льготы
		|ИЗ
		|	РегистрСведений.НазначенныеЛьготы.СрезПоследних(&ТекПериод, ) КАК НазначенныеЛьготыСрезПоследних
		|ГДЕ
		|	НазначенныеЛьготыСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(Льготы.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛС_Льготы,
		|	ЕСТЬNULL(Субсидии.ЛицевойСчет, ЗНАЧЕНИЕ(Справочник.ЛицевыеСчета.ПустаяСсылка)) КАК ЛС_Субсидия
		|ПОМЕСТИТЬ ТАБ
		|ИЗ
		|	Льготы КАК Льготы
		|		ПОЛНОЕ СОЕДИНЕНИЕ Субсидии КАК Субсидии
		|		ПО Льготы.ЛицевойСчет = Субсидии.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТАБ.ЛС_Льготы,
		|	ТАБ.ЛС_Субсидия
		|ИЗ
		|	ТАБ КАК ТАБ";
		
		Запрос.УстановитьПараметр("ТекПериод", ТекущаяДата());
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.ЛС_Льготы <> Справочники.ЛицевыеСчета.ПустаяСсылка()
				И Выборка.ЛС_Субсидия <> Справочники.ЛицевыеСчета.ПустаяСсылка() ТОГДА
				НоваяСтрока = ЛицевыеСчета.Добавить();
				НоваяСтрока.ЛицевойСчет = Выборка.ЛС_Льготы;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если ЛицевыеСчета.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;	


	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии()
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()

	Константы.НеПроверятьПересечениеЛьготИСубсидийПриЗапуске.Установить(НеПоказывать);

КонецПроцедуры // ()
